; domain
(define (domain pineapple-sherbet)
  (:requirements :strips :typing)
  (:types
      food
      ingredient - food
      mixture - food
      sherbet - food
      container
      appliance
      utensil
      location
  )

  (:predicates
      (at ?entity - object ?location - location)
      (in ?entity - food ?container - container)
      (state ?appliance - appliance ?status - status)
      (is-fresh ?ingredient - ingredient)
      (blended ?food - food)
      (frozen ?food - food)
  )

  (:action put-in-blender
    :parameters (?ingredient - ingredient ?blender - appliance)
    :precondition (and (at ?ingredient kitchen) (at ?blender kitchen))
    :effect (and (in ?ingredient ?blender) (not (at ?ingredient kitchen)))
  )

  (:action blend-pineapple
    :parameters (?pineapple - ingredient ?blender - appliance)
    :precondition (and (is-fresh ?pineapple) (in ?pineapple ?blender) (state ?blender off))
    :effect (and (blended ?pineapple) (state ?blender on))
  )

  (:action add-ingredient
    :parameters (?ingredient - ingredient ?blender - appliance)
    :precondition (and (at ?ingredient kitchen) (at ?blender kitchen))
    :effect (and (in ?ingredient ?blender) (not (at ?ingredient kitchen)))
  )

  (:action blend-all
    :parameters (?blender - appliance ?mixture - mixture)
    :precondition (and
      (in pineapple ?blender)
      (in milk ?blender)
      (in oil ?blender)
      (in sugar ?blender)
      (in extract ?blender)
      (state ?blender off)
    )
    :effect (and
      (not (in pineapple ?blender))
      (not (in milk ?blender))
      (not (in oil ?blender))
      (not (in sugar ?blender))
      (not (in extract ?blender))
      (in ?mixture ?blender)
      (state ?blender on)
    )
  )

  (:action pour-into-dish
    :parameters (?mixture - mixture ?blender - appliance ?dish - container)
    :precondition (and (in ?mixture ?blender) (at ?blender kitchen) (at ?dish kitchen))
    :effect (and
      (not (in ?mixture ?blender))
      (in ?mixture ?dish)
    )
  )

  (:action freeze-mixture
    :parameters (?mixture - mixture ?dish - container ?freezer - location ?sherbet - sherbet)
    :precondition (and (in ?mixture ?dish) (at ?dish kitchen) (at ?freezer kitchen))
    :effect (and
      (not (in ?mixture ?dish))
      (in ?sherbet ?dish)
      (at ?dish ?freezer)
      (frozen ?sherbet)
    )
  )

  (:action serve-sherbet
    :parameters (?sherbet - sherbet ?dish - container ?plate - container)
    :precondition (and (in ?sherbet ?dish) (at ?dish freezer) (frozen ?sherbet))
    :effect (and
      (not (in ?sherbet ?dish))
      (in ?sherbet ?plate)
      (at ?dish kitchen)
    )
  )
)

; problem
(define (problem make-pineapple-sherbet)
  (:domain pineapple-sherbet)

  (:objects
      pineapple milk oil sugar extract - ingredient
      mixture - mixture
      sherbet - sherbet
      blender - appliance
      dish plate - container
      freezer kitchen - location
  )

  (:init
      (at pineapple kitchen)
      (at milk kitchen)
      (at oil kitchen)
      (at sugar kitchen)
      (at extract kitchen)
      (at blender kitchen)
      (at dish kitchen)
      (at plate kitchen)
      (at freezer kitchen)

      (is-fresh pineapple)
      (state blender off)
  )

  (:goal
      (and (in sherbet plate))
  )
)

; plan
1. (add-ingredient sugar blender)
   deleted: (at sugar kitchen)
   added: (in sugar blender)
   goals met: 0 of 1
2. (add-ingredient pineapple blender)
   deleted: (at pineapple kitchen)
   added: (in pineapple blender)
   goals met: 0 of 1
3. (add-ingredient oil blender)
   deleted: (at oil kitchen)
   added: (in oil blender)
   goals met: 0 of 1
4. (add-ingredient milk blender)
   deleted: (at milk kitchen)
   added: (in milk blender)
   goals met: 0 of 1
5. (add-ingredient extract blender)
   deleted: (at extract kitchen)
   added: (in extract blender)
   goals met: 0 of 1
6. (blend-all blender mixture)
   deleted: (in pineapple blender) (in milk blender) (in oil blender) (in sugar blender) (in extract blender)
   added: (in mixture blender) (state blender on)
   goals met: 0 of 1
7. (pour-into-dish mixture blender plate)
   deleted: (in mixture blender)
   added: (in mixture plate)
   goals met: 0 of 1
8. (freeze-mixture mixture plate freezer sherbet)
   deleted: (in mixture plate)
   added: (in sherbet plate) (at plate freezer) (frozen sherbet)
   goals met: 1 of 1
